<template>
  <div class="main">
    <div class="title">top-10 санаториев Алтайского края</div>
    <div v-if="!show" class="grid">
      <div
        v-for="btn in btns"
        :key="btn.name"
        @click="openGallery(btn.name)"
        class="item"
      >
        <img :src="btn.path" alt="" />
      </div>
    </div>
    <transition name="fade">
      <div v-if="show" class="season-gallery">
        <GalleryComplex @close="show = false" :list="list" cover />
      </div>
    </transition>
    <Back @back="$router.go(-1)" bottom />
  </div>
</template>

<script>
import Back from "@/components/UI/Back.vue";
import Gallery from "@/components/Gallery.vue";
import GalleryComplex from "@/components/GalleryComplex.vue";
import GalleryEvents from "@/components/GalleryEvents.vue";

export default {
  name: "Sanatoriums",
  components: { GalleryEvents, GalleryComplex, Gallery, Back },
  data() {
    return {
      show: false,
      list: [],
      allPhotos: {
        1: [
          {
            path: require("@/assets/complex/belokur/1.jpg"),
            title: "Санаторий «Катунь»",
            content: {
              contacts: {
                address: "г.Белокуриха, ул. Славского, 44",
                phone: "8-800-707-51-84, <br> 8-800-707-51-83",
                site: "katun-san.ru",
              },
            },
          },
          {
            path: require("@/assets/complex/belokur/2.jpg"),
            title: "Санаторий «Катунь»",
            content: {
              text: "Ведущее объединение курорта Белокуриха, в состав которого входят три здравницы — «Белокуриха», «Сибирь», «Катунь». <br> <br>  Наличие 3-х санаториев с разной ценовой политикой и медицинским профилем позволяет подобрать оптимальный вариант лечения, оздоровления и отдыха на Алтае. <br><br> Санатории  постоянно обновляются и улучшаются: модернизируется оборудование, реконструируются номера для проживания. А персонал здравницы окружает отдыхающих заботой и вниманием, чтобы каждый чувствовал себя как дома.",
            },
          },
          {
            path: require("@/assets/complex/belokur/3.jpg"),
            title: "Санаторий «Катунь»",
          },
          {
            path: require("@/assets/complex/belokur/4.jpg"),
            title: "Санаторий «Катунь»",
          },
          {
            path: require("@/assets/complex/belokur/5.jpg"),
            title: "Санаторий «Белокуриха»",
            content: {
              contacts: {
                address: " г.Белокуриха, ул.Славского, 9",
                phone: "8-800-707-51-84, <br> 8-800-707-51-83",
                site: " belokurikha-san.ru",
              },
            },
          },
          {
            path: require("@/assets/complex/belokur/6.jpg"),
            title: "Санаторий «Белокуриха»",
            content: {
              text: "Ведущее объединение курорта Белокуриха, в состав которого входят три здравницы — «Белокуриха», «Сибирь», «Катунь». <br> <br>  Наличие 3-х санаториев с разной ценовой политикой и медицинским профилем позволяет подобрать оптимальный вариант лечения, оздоровления и отдыха на Алтае. <br><br> Санатории  постоянно обновляются и улучшаются: модернизируется оборудование, реконструируются номера для проживания. А персонал здравницы окружает отдыхающих заботой и вниманием, чтобы каждый чувствовал себя как дома.",
            },
          },
          {
            path: require("@/assets/complex/belokur/7.jpg"),
            title: "Санаторий «Белокуриха»",
          },
          {
            path: require("@/assets/complex/belokur/8.jpg"),
            title: "Санаторий «Белокуриха»",
          },
          {
            path: require("@/assets/complex/belokur/9.jpg"),
            title: "Санаторий «Сибирь»",
            content: {
              contacts: {
                address: " г.Белокуриха, ул.Славского, 67",
                phone: "8-800-707-51-84, <br> 8-800-707-51-83",
                site: "sibir-san.ru",
              },
            },
          },
          {
            path: require("@/assets/complex/belokur/10.jpg"),
            title: "Санаторий «Сибирь»",
            content: {
              text: "Ведущее объединение курорта Белокуриха, в состав которого входят три здравницы — «Белокуриха», «Сибирь», «Катунь». <br> <br>  Наличие 3-х санаториев с разной ценовой политикой и медицинским профилем позволяет подобрать оптимальный вариант лечения, оздоровления и отдыха на Алтае. <br><br> Санатории  постоянно обновляются и улучшаются: модернизируется оборудование, реконструируются номера для проживания. А персонал здравницы окружает отдыхающих заботой и вниманием, чтобы каждый чувствовал себя как дома.",
            },
          },
          {
            path: require("@/assets/complex/belokur/11.jpg"),
            title: "Санаторий «Сибирь»",
          },
          {
            path: require("@/assets/complex/belokur/12.jpg"),
            title: "Санаторий «Сибирь»",
          },
          {
            path: require("@/assets/complex/belokur/13.jpg"),
            title: "Санаторий «Сибирь»",
          },
          {
            path: require("@/assets/complex/belokur/14.jpg"),
            title: "Санаторий «Сибирь»",
          },
        ],
        2: [
          {
            path: require("@/assets/complex/russia/1.jpg"),
            title: "Санаторий «Россия»",
            content: {
              contacts: {
                address: "г.Белокуриха, ул. Славского, 34",
                phone: "(38577) 3-77-77, <br> 8-800-250-37-70",
                site: "www.sanrussia.ru",
              },
            },
          },
          {
            path: require("@/assets/complex/russia/2.jpg"),
            title: "Санаторий «Россия»",
            content: {
              text: "Расположен в самом в центре курортной зоны города Белокуриха. <br><br> Площадь территории санаторного комплекса составляет более 8 Га. Она ограждена от автомобильной дороги горной грядой и сосновым бором, что создает атмосферу спокойствия и уюта, а также исключает шум и пыль. <br><br> Комплекс санатория «Россия» состоит из двух 10-этажных жилых корпусов самого санатория, отдельного двухэтажного эко-отеля «Эхо» и лечебно-оздоровительного корпуса.",
            },
          },
          {
            path: require("@/assets/complex/russia/3.jpg"),
            title: "Санаторий «Россия»",
            content: {
              text: "Корпус санатория и лечебных отделений соединены между собой теплыми переходами. <br><br> Размещение отдыхающих производят в уютные, оборудованные всем необходимым для комфортного отдыха номера категории 3 и 4 звезды.<br><br> Высокий уровень обслуживания, неповторимые виды на горные пейзажи, лечебные природные факторы и современные методики оздоровления позволяют отдохнуть и укрепить здоровье. <br> Помимо классического санаторно-курортного лечения к услугам гостей санатория современный велнес-центр «TerraSPA».",
            },
          },
          {
            path: require("@/assets/complex/russia/4.jpg"),
            title: "Санаторий «Россия»",
          },
        ],
        10: [
          {
            path: require("@/assets/complex/centr/1.jpg"),
            title: "Санаторий Центросоюза РФ в&nbspг.Белокуриха",
            content: {
              contacts: {
                address: "г.Белокуриха, ул. Славского, 45",
                phone:
                  "(38577) 2-44-32,<br>(38577) 2-09-25,<br>(38577) 2-35-87,<br> 8-800-100-09-75",
                site: "centrosouz.ru",
              },
            },
          },
          {
            path: require("@/assets/complex/centr/2.jpg"),
            title: "Санаторий Центросоюза РФ в&nbspг.Белокуриха",
            content: {
              text:
                "Санаторий Центросоюза РФ в г. Белокуриха расположен в самом сердце курорта, в непосредственной близости от природных достопримечательностей, горнолыжной трассы, терренкуров и канатной дороги, на берегу горной реки Белокуриха. <br><br>" +
                "Одно из основных преимуществ санатория – это его компактность, 340 мест, что позволяет отдыхающим чувствовать индивидуальную заботу и внимание во всех мелочах. <br><br>" +
                "Кроме традиционного лечения в санатории предлагают медицинские услуги на основе продукции мараловодства (пантолечение). Расслабиться после процедур, отдохнуть и получить удовольствие – для всего этого как нельзя лучше подойдет большой крытый бассейн санатория Центросоюза с гейзером, водопадом, сауной и хаммамом.",
            },
          },
          {
            path: require("@/assets/complex/centr/3.jpg"),
            title: "Санаторий Центросоюза РФ в&nbspг.Белокуриха",
            content: {
              text:
                "В теплое время года для всех гостей санатория бесплатно работает летний бассейн с водной горкой и выделенной детской зоной. Вдоль санатория расположена обновленная набережная - излюбленное место прогулок отдыхающих.<br><br>" +
                "Пребывание в санатории Центросоюза РФ в г. Белокуриха гарантирует гостям положительные эмоции и незабываемый отдых.",
            },
          },
          {
            path: require("@/assets/complex/centr/4.jpg"),
            title: "Санаторий Центросоюза РФ в&nbspг.Белокуриха",
          },
          {
            path: require("@/assets/complex/centr/5.jpg"),
            title: "Санаторий Центросоюза РФ в&nbspг.Белокуриха",
          },
        ],
        6: [
          {
            path: require("@/assets/complex/rzhd/1.jpg"),
            title: "Санаторий-профилакторий «Алтай»",
            content: {
              contacts: {
                address: "г.Новоалтайск, ул.Ушакова, 8",
                phone: "(38532) 3-57-54,<br> (38532) 3-21-31",
              },
            },
          },
          {
            path: require("@/assets/complex/rzhd/2.jpg"),
            title: "Санаторий-профилакторий «Алтай»",
            content: {
              text:
                "Комплекс санатория-профилактория представлен четырехэтажным жилым корпусом, соединенным с двухэтажным лечебным теплым переходом. <br><br>" +
                "Жилой корпус рассчитан на одновременное пребывание 100 гостей. Размещение отдыхающих производят в комфортных двухместных номерах. <br><br>" +
                "Несмотря на небольшие масштабы, в санатории широкая лечебно- диагностическая база, которая соответствует лечебному отделению крупного санатория. <br><br>" +
                "В перечень услуг санатория-профилактория включены следующие методики: гидропатия, грязелечение, различные виды массажа, глинотерапия, лечебные ванны, гипоксигиперкапния, спелеолечение и многие другие.",
            },
          },
          {
            path: require("@/assets/complex/rzhd/3.jpg"),
            title: "Санаторий-профилакторий «Алтай»",
          },
          {
            path: require("@/assets/complex/rzhd/4.jpg"),
            title: "Санаторий-профилакторий «Алтай»",
          },
          {
            path: require("@/assets/complex/rzhd/5.jpg"),
            title: "Санаторий-профилакторий «Алтай»",
          },
          {
            path: require("@/assets/complex/rzhd/6.jpg"),
            title: "Санаторий-профилакторий «Алтай»",
          },
        ],
        4: [
          {
            path: require("@/assets/complex/zamok/1.jpg"),
            title: "Санаторий «Алтайский замок»",
            content: {
              contacts: {
                address: "г.Белокуриха, ул. Славского, 29",
                phone: "(38577) 2-19-94,<br> 8-800-700-09-44",
                site: "altzamok.ru",
              },
            },
          },
          {
            path: require("@/assets/complex/zamok/2.jpg"),
            title: "Санаторий «Алтайский замок»",
            content: {
              text:
                "Более 15 лет санаторий успешно занимается оздоровлением по различным профилям лечения. Ежегодно здесь проводят научные конференции, посвященные санаторно-курортному лечению с участием ведущих ученых страны. <br><br>" +
                "«Алтайский замок» является одним из немногих российских санаторно-курортных учреждений, которые ведут совместную научную деятельность с учеными Германии. <br><br>" +
                "На сегодняшний день санаторий является обладателем 25 патентов на уникальные методы диагностики и лечения. Внедряется 26 патент по программе планирования беременности.",
            },
          },
          {
            path: require("@/assets/complex/zamok/3.jpg"),
            title: "Санаторий «Алтайский замок»",
          },
          {
            path: require("@/assets/complex/zamok/4.jpg"),
            title: "Санаторий «Алтайский замок»",
          },
        ],
        3: [
          {
            path: require("@/assets/complex/altay/1.jpg"),
            title: "Санаторий «Алтай»",
            content: {
              contacts: {
                address: "г.Белокуриха, ул. Славского, 39",
                phone:
                  "(38577) 2-05-90, <br>(38577) 3-40-90,<br> 8-800-250-01-67,<br> 8-800-250-67-67",
                site: "altai-west.ru",
              },
            },
          },
          {
            path: require("@/assets/complex/altay/2.jpg"),
            title: "Санаторий «Алтай»",
            content: {
              text: "Расположен в самом сердце курортно-санаторной зоны города Белокурихи. Территория санатория занимает более 10 Га. Жилое отделение санатория расположено в трех зданиях, объединенных между собой и с лечебным корпусом теплыми переходами. <br><br> Территория санатория с ее ухоженными пешеходными дорожками, газонами, цветниками, зелеными скульптурами, архитектурными формами располагает к неспешным прогулкам, уединенным беседам с семьей и друзьями. <br><br>В санатории «Алтай» все обустроено с максимальным комфортом, как для проживания и лечения, так и для незабываемого отдыха. В санатории есть ночной, бильярдный и караоке-клуб, киноконцертный зал, рестораны. ",
            },
          },
          {
            path: require("@/assets/complex/altay/3.jpg"),
            title: "Санаторий «Алтай»",
            content: {
              text: "  К услугам отдыхающих в санатории работает два бассейна: закрытый круглогодичный и летний открытый, оборудованный пляжной зоной. <br><br> Кроме того, здесь работает СПА-центр «Алтай Bliss», спорт-зал и фитнес-центр. <br><br> Для самых маленьких гостей в санатории есть игровой клуб «Зазеркалье» с отдельными тематическими зонами для детей всех возрастов: мягкая игровая зона, компьютерно-игровой зал, творческая мастерская, тренажеры, горки, сухой бассейн, детский театр. С детьми проводят увлекательные мастер-классы.",
            },
          },
          {
            path: require("@/assets/complex/altay/4.jpg"),
            title: "Санаторий «Алтай»",
          },
          {
            path: require("@/assets/complex/altay/5.jpg"),
            title: "Санаторий «Алтай»",
          },
        ],
        8: [
          {
            path: require("@/assets/complex/sant/1.jpg"),
            title: "Санаторий «Родник Алтая»",
            content: {
              contacts: {
                address: "г.Белокуриха, ул.Братьев Ждановых, 2",
                phone: "(38577) 3-30-03,<br> 8-800-444-22-08",
                site: "rodnik-altaya.com",
              },
            },
          },
          {
            path: require("@/assets/complex/sant/2.jpg"),
            title: "Санаторий «Родник Алтая»",
            content: {
              text:
                "Расположен в городе Белокуриха в некотором отдалении от основной санаторно-курортной зоны и магистральных улиц. <br><br>" +
                "Санаторий окружен сосновым бором. Все это создает особую атмосферу уединенности и тишины. А целебный предгорный воздух, насыщенный аэроионами и эфирами хвойных масел, создает особый микроклимат.<br><br>" +
                "Комплекс зданий санатория включает в себя два основных корпуса, соединенных между собой теплым переходом. <br><br>" +
                "Санаторий идеален для семейного отдыха. Здравница имеет многолетнюю практику лечения и оздоровления взрослых и детей. А большая площадь жилых номеров позволяет комфортно размещаться гостям с двумя и более детьми.",
            },
          },
          {
            path: require("@/assets/complex/sant/3.jpg"),
            title: "Санаторий «Родник Алтая»",
          },
          {
            path: require("@/assets/complex/sant/4.jpg"),
            title: "Санаторий «Родник Алтая»",
          },
          {
            path: require("@/assets/complex/sant/5.jpg"),
            title: "Санаторий «Родник Алтая»",
          },
          {
            path: require("@/assets/complex/sant/6.jpg"),
            title: "Санаторий «Родник Алтая»",
          },
          {
            path: require("@/assets/complex/sant/7.jpg"),
            title: "Санаторий «Родник Алтая»",
          },
        ],
        9: [
          {
            path: require("@/assets/complex/edem/1.jpg"),
            title: "Санаторий «Эдем»",
            content: {
              contacts: {
                address: "г.Белокуриха, ул.Славского, 40",
                phone:
                  "(38577) 3-71-77, <br>(38577) 2-03-22,<br> 8-800-700-99-92",
                site: "edem-altay.ru",
              },
            },
          },
          {
            path: require("@/assets/complex/edem/2.jpg"),
            title: "Санаторий «Эдем»",
            content: {
              text:
                "Трехэтажное здание санатория рассчитано на небольшое количество гостей. Это создает идеальные условия для спокойного и уединенного отдыха. <br><br>" +
                "Номерной фонд санатория состоит из 37 комфортабельных номеров, 8 из них в двух уровнях. Все номера выполнены в индивидуальном дизайне. Небольшой номерной фонд позволяет организовать спокойный отдых для гостей без шума и очередей. <br><br>" +
                "Жилое и лечебное отделения санатория расположены в одном корпусе. Несмотря на небольшие масштабы, в санатории широкая лечебно- диагностическая база, которая соответствует лечебному отделению крупного санатория. <br><br>",
            },
          },
          {
            path: require("@/assets/complex/edem/3.jpg"),
            title: "Санаторий «Эдем»",
            content: {
              text:
                "Одним из первых на курорте санатория «Эдем» начал активно использовать минеральную питьевую воду «Завьяловскую» и «Серебряный ключ» в качестве дополнительного оздоравливающего фактора. <br><br>" +
                "Из нетрадиционной медицины в санатории широко применяют гирудотерапию, массаж Гуаша.",
            },
          },
          {
            path: require("@/assets/complex/edem/4.jpg"),
            title: "Санаторий «Эдем»",
          },
          {
            path: require("@/assets/complex/edem/5.jpg"),
            title: "Санаторий «Эдем»",
          },
          {
            path: require("@/assets/complex/edem/6.jpg"),
            title: "Санаторий «Эдем»",
          },
          {
            path: require("@/assets/complex/edem/7.jpg"),
            title: "Санаторий «Эдем»",
          },
          {
            path: require("@/assets/complex/edem/8.jpg"),
            title: "Санаторий «Эдем»",
          },
        ],
        5: [
          {
            path: require("@/assets/complex/dol/1.jpg"),
            title: "Лечебно-оздоровительный комплекс «Долина Алтая»",
            content: {
              contacts: {
                address: "Алтайский район, с.Даниловка, ул.Лесная, 10",
                phone:
                  "(38577) 3-40-15, <br> (38577) 2-25-21,<br> +7-962-804-50-00",
                site: "dolinaaltai.ru",
              },
            },
          },
          {
            path: require("@/assets/complex/dol/2.jpg"),
            title: "Лечебно-оздоровительный комплекс «Долина Алтая»",
            content: {
              text:
                "Принимает гостей круглый год. Экологически чистый горный воздух, обогащенный аэроионами, природная минеральная вода (собственная скважина), месторождение голубой глины, лекарственные травы – основные природные лечебные факторы «Долины Алтая». <br><br>" +
                "В сочетании с новейшими медицинскими методиками и высоким уровнем сервиса они дают непревзойденный эффект в лечении большинства заболеваний и естественном оздоровлении организма.",
            },
          },
          {
            path: require("@/assets/complex/dol/3.jpg"),
            title: "Лечебно-оздоровительный комплекс «Долина Алтая»",
          },
          {
            path: require("@/assets/complex/dol/4.jpg"),
            title: "Лечебно-оздоровительный комплекс «Долина Алтая»",
          },
          {
            path: require("@/assets/complex/dol/5.jpg"),
            title: "Лечебно-оздоровительный комплекс «Долина Алтая»",
          },
          {
            path: require("@/assets/complex/dol/6.jpg"),
            title: "Лечебно-оздоровительный комплекс «Долина Алтая»",
          },
          {
            path: require("@/assets/complex/dol/7.jpg"),
            title: "Лечебно-оздоровительный комплекс «Долина Алтая»",
          },
          {
            path: require("@/assets/complex/dol/8.jpg"),
            title: "Лечебно-оздоровительный комплекс «Долина Алтая»",
          },
          {
            path: require("@/assets/complex/dol/9.jpg"),
            title: "Лечебно-оздоровительный комплекс «Долина Алтая»",
          },
          {
            path: require("@/assets/complex/dol/10.jpg"),
            title: "Лечебно-оздоровительный комплекс «Долина Алтая»",
          },
          {
            path: require("@/assets/complex/dol/11.jpg"),
            title: "Лечебно-оздоровительный комплекс «Долина Алтая»",
          },
        ],
        7: [
          {
            path: require("@/assets/complex/belo/1.jpg"),
            title: "Курортный отель «Беловодье»",
            content: {
              contacts: {
                address: "г.Белокуриха,  ул.Мясникова, 4",
                phone: "(38577) 3-29-51,<br> 8-800-700-11-13",
                site: "belovodie.su",
              },
            },
          },
          {
            path: require("@/assets/complex/belo/2.jpg"),
            title: "Курортный отель «Беловодье»",
            content: {
              text:
                "Первый и единственный 4 звездочный отель, имеющий лицензию на оказание санаторно-курортных услуг.<br><br>" +
                "Спектр медицинских услуг включает в себя лечение и консультацию врачей: терапевта, мануального терапевта, невролога, детского невролога, гинеколога, уролога, психотерапевта.<br><br>" +
                "Дети до 7 лет проживают и питаются бесплатно. <br><br>" +
                "К услугам гостей Аквапарк с комплексом бань и саун. В ресторане живая музыка.",
            },
          },
          {
            path: require("@/assets/complex/belo/3.jpg"),
            title: "Курортный отель «Беловодье»",
          },
          {
            path: require("@/assets/complex/belo/4.jpg"),
            title: "Курортный отель «Беловодье»",
          },
          {
            path: require("@/assets/complex/belo/5.jpg"),
            title: "Курортный отель «Беловодье»",
          },
          {
            path: require("@/assets/complex/belo/6.jpg"),
            title: "Курортный отель «Беловодье»",
          },
          {
            path: require("@/assets/complex/belo/7.jpg"),
            title: "Курортный отель «Беловодье»",
          },
        ],
      },
      btns: [
        {
          path: require("@/assets/complex/banners/1.png"),
          name: "1",
        },
        {
          path: require("@/assets/complex/banners/2.png"),
          name: "2",
        },
        {
          path: require("@/assets/complex/banners/3.png"),
          name: "3",
        },
        {
          path: require("@/assets/complex/banners/4.png"),
          name: "4",
        },
        {
          path: require("@/assets/complex/banners/5.png"),
          name: "5",
        },
        {
          path: require("@/assets/complex/banners/6.png"),
          name: "6",
        },
        {
          path: require("@/assets/complex/banners/7.png"),
          name: "7",
        },
        {
          path: require("@/assets/complex/banners/8.png"),
          name: "8",
        },
        {
          path: require("@/assets/complex/banners/9.png"),
          name: "9",
        },
        {
          path: require("@/assets/complex/banners/10.png"),
          name: "10",
        },
      ],
    };
  },
  methods: {
    openGallery(name) {
      this.list = this.allPhotos[name];
      this.show = true;
    },
  },
};
</script>

<style lang="scss" scoped>
.main,
.season-gallery {
  background: url("@/assets/complex/bg.png") center / cover no-repeat;
}

.grid {
  display: grid;
  grid-template-columns: repeat(5, 1fr);
  gap: 40px;
  margin: 100px 130px 0;
}

.item {
  width: 299px;
  height: 297px;

  img {
    width: 100%;
    height: 100%;
  }

  animation: slide-in 0.6s cubic-bezier(0.23, 1, 0.32, 1) both;

  &:nth-child(1) {
    animation-delay: 0s;
    animation-name: slide-in2;
  }

  &:nth-child(2) {
    animation-delay: 0.2s;
  }

  &:nth-child(3) {
    animation-delay: 0.4s;
  }

  &:nth-child(4) {
    animation-delay: 0.1s;
    animation-name: slide-in2;
  }

  &:nth-child(5) {
    animation-delay: 0.6s;
  }

  &:nth-child(6) {
    animation-delay: 0s;
  }

  &:nth-child(7) {
    animation-delay: 0.2s;
    animation-name: slide-in2;
  }

  &:nth-child(8) {
    animation-delay: 0.3s;
  }

  &:nth-child(9) {
    animation-delay: 0.4s;
  }

  &:nth-child(10) {
    animation-delay: 0.7s;
    animation-name: slide-in2;
  }
}
</style>
